# St7SetMovingLoadTimeTable

Specifies the Factor vs Time table to be associated with a given load path for the analysis.

long St7SetMovingLoadTimeTable(long uID, long LoadPathID, long TableID)

Input Parameters

uID

Strand7 model file ID.

LoadPathID

Load path ID.

TableID

Factor vs Time table ID number, or 0 to clear the table.